vegeta-cli/src/vegeta/aeromant/templates/laminar_external/com/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case — values in {{...}} are inserted by aeromant.prepare()
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         {{ITERATIONS}};
deltaT          1;
writeControl    timeStep;
writeInterval   {{ITERATIONS}};
purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable false;

functions
{
    forceCoeffs
    {
        type            forceCoeffs;
        libs            ("libforces.so");
        writeControl    timeStep;
        writeInterval   1;
        log             yes;
        patches         ("body.*");
        rho             rhoInf;
        rhoInf          {{DENSITY}};
        liftDir         (0 0 1);
        dragDir         (1 0 0);
        CofR            ({{CENTER_OF_ROTATION}});
        pitchAxis       (0 1 0);
        magUInf         {{VELOCITY}};
        lRef            {{REFERENCE_LENGTH}};
        Aref            {{REFERENCE_AREA}};
    }
}

// ************************************************************************* //
